fix diagram
